IDENTIFICATION DIVISION.
PROGRAM-ID. COUNTUP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-INDEX  PIC 9(2) VALUE 1.

PROCEDURE DIVISION.
    PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 4
        DISPLAY "NUMBER: " WS-INDEX
    END-PERFORM.
    STOP RUN.
