IDENTIFICATION DIVISION.
PROGRAM-ID. TEMPCHECK.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TEMP PIC 9(3) VALUE 95.

PROCEDURE DIVISION.
    IF WS-TEMP >= 90
        DISPLAY "HOT"
    ELSE
        DISPLAY "MILD"
    END-IF
    STOP RUN.
