IDENTIFICATION DIVISION.
PROGRAM-ID. COUNTDOWN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-INDEX  PIC 9(2) VALUE 5.

PROCEDURE DIVISION.
    PERFORM UNTIL WS-INDEX < 1
        DISPLAY "REMAINING: " WS-INDEX
        SUBTRACT 1 FROM WS-INDEX
    END-PERFORM.
    DISPLAY "DONE COUNTING".
    STOP RUN.
