IDENTIFICATION DIVISION.
PROGRAM-ID. PARAGREET.

PROCEDURE DIVISION.
MAIN-LOGIC.
    DISPLAY "BEGIN".
    PERFORM SAY-HELLO 3 TIMES.
    DISPLAY "END".
    STOP RUN.

SAY-HELLO.
    DISPLAY "HELLO FROM PARAGREET".
