IDENTIFICATION DIVISION.
PROGRAM-ID. ORDERCHECK.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-ORDER-TOTAL  PIC 9(5) VALUE 250.

PROCEDURE DIVISION.
    IF WS-ORDER-TOTAL >= 200
        DISPLAY "FREE SHIPPING"
    ELSE
        DISPLAY "SHIPPING FEE APPLIES"
    END-IF.
    STOP RUN.
