IDENTIFICATION DIVISION.
PROGRAM-ID. SUMTWO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-RESULT  PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
    COMPUTE WS-RESULT = 15 + 27.
    DISPLAY "SUM: " WS-RESULT.
    STOP RUN.
