IDENTIFICATION DIVISION.
PROGRAM-ID. TRIPLER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-N PIC 9(3) VALUE 8.
01 WS-RESULT PIC 9(5).

PROCEDURE DIVISION.
    COMPUTE WS-RESULT = WS-N * 3
    DISPLAY "RESULT: " WS-RESULT
    STOP RUN.
