IDENTIFICATION DIVISION.
PROGRAM-ID. EMPLOYEEID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-EMPLOYEE-NAME  PIC X(20) VALUE "UNASSIGNED".

PROCEDURE DIVISION.
    MOVE "JOHNSON" TO WS-EMPLOYEE-NAME.
    DISPLAY "EMPLOYEE: " WS-EMPLOYEE-NAME.
    STOP RUN.
