IDENTIFICATION DIVISION.
PROGRAM-ID. INVENTORY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-STOCK-COUNT  PIC 9(4) VALUE 50.

PROCEDURE DIVISION.
    SUBTRACT 12 FROM WS-STOCK-COUNT.
    DISPLAY "STOCK: " WS-STOCK-COUNT.
    STOP RUN.
